In [2]:
library(tidyverse)

# Count observations by group

`count()` lets you quickly count the unique values of one or more variables: `df %>% count(a, b)` is roughly equivalent to `df %>% group_by(a, b) %>% summarise(n = n())`. `count()` is paired with `tally()`, a lower-level helper that is equivalent to `df %>% summarise(n = n())`. Supply `wt` to perform weighted counts, switching the summary from `n = n()` to `n = sum(wt)`.

`add_count()` are `add_tally()` are equivalents to `count()` and `tally()` but use `mutate()` instead of `summarise()` so that they add a new column with group-wise counts.

```R
count(
  x,
  ...,
  wt = NULL,
  sort = FALSE,
  name = NULL,
  .drop = group_by_drop_default(x)
)

tally(x, wt = NULL, sort = FALSE, name = NULL)

add_count(x, ..., wt = NULL, sort = FALSE, name = NULL, .drop = deprecated())

add_tally(x, wt = NULL, sort = FALSE, name = NULL)
```

# Examples

count is a convenient way to get a sense of the distribution of values in a dataset

In [6]:
#Count the number of observations for each `manufacturer` in `mpg`
mpg  %>% count(manufacturer)

   manufacturer n
1  audi         18
2  chevrolet    19
3  dodge        37
4  ford         25
5  honda         9
6  hyundai      14
7  jeep          8
8  land rover    4
9  lincoln       3
10 mercury       4
11 nissan       13
12 pontiac       5
13 subaru       14
14 toyota       34
15 volkswagen   27

In [9]:
#Sort by the the result of count 
mpg %>% count(manufacturer, sort = T)

   manufacturer n
1  dodge        37
2  toyota       34
3  volkswagen   27
4  ford         25
5  chevrolet    19
6  audi         18
7  hyundai      14
8  subaru       14
9  nissan       13
10 honda         9
11 jeep          8
12 pontiac       5
13 land rover    4
14 mercury       4
15 lincoln       3

In [11]:
#Count the number of observations for each manufacturer AND model, sort the result
mpg %>% count(manufacturer, model, sort = T)

   manufacturer model                  n
1  dodge        caravan 2wd            11
2  dodge        ram 1500 pickup 4wd    10
3  dodge        dakota pickup 4wd       9
4  ford         mustang                 9
5  honda        civic                   9
6  volkswagen   jetta                   9
7  audi         a4 quattro              8
8  jeep         grand cherokee 4wd      8
9  subaru       impreza awd             8
10 audi         a4                      7
11 dodge        durango 4wd             7
12 ford         f150 pickup 4wd         7
13 hyundai      sonata                  7
14 hyundai      tiburon                 7
15 toyota       camry                   7
16 toyota       camry solara            7
17 toyota       toyota tacoma 4wd       7
18 volkswagen   passat                  7
19 ford         explorer 4wd            6
20 nissan       altima                  6
21 subaru       forester awd            6
22 toyota       4runner 4wd             6
23 volkswagen   new beetle              6
24 chevrolet    c1500 suburban 2wd      5
25 chevrolet    corvette                5
26 chevrolet    malibu                  5
27 pontiac      grand prix              5
28 toyota       corolla                 5
29 volkswagen   gti                     5
30 chevrolet    k1500 tahoe 4wd         4
31 land rover   range rover             4
32 mercury      mountaineer 4wd         4
33 nissan       pathfinder 4wd          4
34 audi         a6 quattro              3
35 ford         expedition 2wd          3
36 lincoln      navigator 2wd           3
37 nissan       maxima                  3
38 toyota       land cruiser wagon 4wd  2

In [14]:
#Round `Sepal.Length` then calculate frequency for each value
iris %>% count(round(Sepal.Length))

  round(Sepal.Length) n
1 4                    5
2 5                   47
3 6                   68
4 7                   24
5 8                    6

use the `wt` argument to perform a weighted count. This is useful
when the data has already been aggregated once

In [15]:
library(titanic)

Warning message:
"package 'titanic' was built under R version 3.6.3"

In [17]:
df <- titanic_train %>% select(Sex, Survived)

df %>% head()

  Sex    Survived
1 male   0
2 female 1
3 female 1
4 female 1
5 male   0
6 male   0

In [18]:
#The number of man survivied and woman survived
df %>% count(Sex, wt = Survived)

  Sex    n
1 female 233
2 male   109

`tally()` is a lower-level function that assumes you've done the grouping

In [22]:
mpg %>% group_by(manufacturer, model) %>% tally(sort = T)
#Equivalent to: mpg %>% count(manufacturer, model, sort = T)

   manufacturer model                  n
1  dodge        caravan 2wd            11
2  dodge        ram 1500 pickup 4wd    10
3  dodge        dakota pickup 4wd       9
4  ford         mustang                 9
5  honda        civic                   9
6  volkswagen   jetta                   9
7  audi         a4 quattro              8
8  jeep         grand cherokee 4wd      8
9  subaru       impreza awd             8
10 audi         a4                      7
11 dodge        durango 4wd             7
12 ford         f150 pickup 4wd         7
13 hyundai      sonata                  7
14 hyundai      tiburon                 7
15 toyota       camry                   7
16 toyota       camry solara            7
17 toyota       toyota tacoma 4wd       7
18 volkswagen   passat                  7
19 ford         explorer 4wd            6
20 nissan       altima                  6
21 subaru       forester awd            6
22 toyota       4runner 4wd             6
23 volkswagen   new beetle              6
24 chevrolet    c1500 suburban 2wd      5
25 chevrolet    corvette                5
26 chevrolet    malibu                  5
27 pontiac      grand prix              5
28 toyota       corolla                 5
29 volkswagen   gti                     5
30 chevrolet    k1500 tahoe 4wd         4
31 land rover   range rover             4
32 mercury      mountaineer 4wd         4
33 nissan       pathfinder 4wd          4
34 audi         a6 quattro              3
35 ford         expedition 2wd          3
36 lincoln      navigator 2wd           3
37 nissan       maxima                  3
38 toyota       land cruiser wagon 4wd  2

both `count()` and `tally()` have add_ variants that work like
`mutate()` instead of summarise

In [24]:
iris %>% 
add_count(Species) %>%
head()

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species n
1 5.1          3.5         1.4          0.2         setosa  50
2 4.9          3.0         1.4          0.2         setosa  50
3 4.7          3.2         1.3          0.2         setosa  50
4 4.6          3.1         1.5          0.2         setosa  50
5 5.0          3.6         1.4          0.2         setosa  50
6 5.4          3.9         1.7          0.4         setosa  50

In [25]:
iris %>% 
group_by(Species) %>% 
add_tally() %>% 
head()

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species n
1 5.1          3.5         1.4          0.2         setosa  50
2 4.9          3.0         1.4          0.2         setosa  50
3 4.7          3.2         1.3          0.2         setosa  50
4 4.6          3.1         1.5          0.2         setosa  50
5 5.0          3.6         1.4          0.2         setosa  50
6 5.4          3.9         1.7          0.4         setosa  50

# Arguments

```r
count(
  x,
  ...,
  wt = NULL,
  sort = FALSE,
  name = NULL,
  .drop = group_by_drop_default(x)
)

tally(x, wt = NULL, sort = FALSE, name = NULL)

add_count(x, ..., wt = NULL, sort = FALSE, name = NULL, .drop = deprecated())

add_tally(x, wt = NULL, sort = FALSE, name = NULL)
```

### `x`

A data frame, data frame extension (e.g. a tibble), or a lazy data frame (e.g. from dbplyr or dtplyr).

<hr>

In [3]:
#Count the number of observations for each species in `iris` dataset
count(x = iris, Species)

  Species    n
1 setosa     50
2 versicolor 50
3 virginica  50

In [4]:
#Equivalent
iris %>% count(Species)

  Species    n
1 setosa     50
2 versicolor 50
3 virginica  50

### `wt`

<data-masking> Frequency weights. Can be NULL or a variable:

* If NULL (the default), counts the number of rows in each group.

* If a variable, computes sum(`wt`) for each group.

In [6]:
clan <- data.frame(
    name =  c('VNC', 'VNC', 'Dirilis'),
    reward =  c(100, 96, 10)
)

clan

  name    reward
1 VNC     100
2 VNC      96
3 Dirilis  10

In [7]:
#default, wt = NULL
clan %>% count(name)

  name    n
1 Dirilis 1
2 VNC     2

In [8]:
#wt = reward

clan %>% count(name, wt = reward)

  name    n
1 Dirilis  10
2 VNC     196

### `sort`

If TRUE, will show the largest groups at the top.

<hr>

In [10]:
#default, sort = FALSE
mpg %>% count(manufacturer)

   manufacturer n
1  audi         18
2  chevrolet    19
3  dodge        37
4  ford         25
5  honda         9
6  hyundai      14
7  jeep          8
8  land rover    4
9  lincoln       3
10 mercury       4
11 nissan       13
12 pontiac       5
13 subaru       14
14 toyota       34
15 volkswagen   27

In [12]:
#sort = TRUE, sort result by count descending
mpg %>% count(manufacturer, sort = T)

   manufacturer n
1  dodge        37
2  toyota       34
3  volkswagen   27
4  ford         25
5  chevrolet    19
6  audi         18
7  hyundai      14
8  subaru       14
9  nissan       13
10 honda         9
11 jeep          8
12 pontiac       5
13 land rover    4
14 mercury       4
15 lincoln       3

### `name`

	
The name of the new column in the output.

If omitted, it will default to n. If there's already a column called n, it will error, and require you to specify the name.

In [13]:
#Set the name of the result column to 'Total Reward'
clan %>% count(name, wt = reward, name = 'Total Reward')

  name    Total Reward
1 Dirilis  10
2 VNC     196

### `.drop`

For `count()`: if FALSE will include counts for empty groups (i.e. for levels of factors that don't exist in the data). Deprecated `in add_count()` since it didn't actually affect the output.

Value